tap "felixkratz/formulae"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "romkatv/powerlevel10k"
brew "bat"
brew "cmake"
brew "commitizen"
brew "coreutils"
brew "harfbuzz"
brew "derby"
brew "eza"
brew "fd"
brew "pango"
brew "ffmpeg"
brew "node"
brew "firebase-cli"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "googletest"
brew "gradle"
brew "htop"
brew "jq"
brew "kdoctor"
brew "links"
brew "lua-language-server"
brew "luarocks"
brew "make"
brew "maven"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "nvm"
brew "openjdk@11"
brew "openjdk@17"
brew "pandoc"
brew "php"
brew "pyenv"
brew "python@3.9"
brew "ripgrep"
brew "stow"
brew "thefuck"
brew "tmux"
brew "vim"
brew "watchman"
brew "wget"
brew "yarn"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "heroku/brew/heroku"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "adobe-digital-editions"
cask "alacritty"
cask "alfred"
cask "alt-tab"
cask "android-file-transfer"
cask "android-platform-tools"
cask "android-studio"
cask "anki"
cask "appcleaner"
cask "arc"
cask "background-music"
cask "balenaetcher"
cask "bitwarden"
cask "brave-browser"
cask "calibre"
cask "chromedriver"
cask "command-x"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "drawio"
cask "duckduckgo"
cask "fanny"
cask "figma"
cask "firefox"
cask "flutter"
cask "font-caskaydia-cove-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sf-pro"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "imageoptim"
cask "iterm2"
cask "kitty"
cask "krisp"
cask "mactex"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "minecraft"
cask "monitorcontrol"
cask "netbeans"
cask "notion"
cask "numi"
cask "obs"
cask "obsidian"
cask "pycharm-ce"
cask "qutebrowser"
cask "rectangle"
cask "scenebuilder"
cask "sf-symbols"
cask "shortcat"
cask "signal"
cask "slack"
cask "spotify"
cask "steam"
cask "surfshark"
cask "telegram"
cask "tempbox"
cask "tor-browser"
cask "via"
cask "vial"
cask "virtualbox"
cask "visual-studio-code"
cask "whatsapp"
cask "wireshark"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "ankitcode.firefly"
vscode "christian-kohler.path-intellisense"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.dotnet"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "helixquar.randomeverything"
vscode "james-yu.latex-workshop"
vscode "knisterpeter.vscode-commitizen"
vscode "mgmcdermott.vscode-language-babel"
vscode "mongodb.mongodb-vscode"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "ritwickdey.liveserver"
vscode "shyykoserhiy.vscode-spotify"
vscode "steoates.autoimport"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wallabyjs.quokka-vscode"
vscode "zhuangtongfa.material-theme"
vscode "znck.grammarly"
